<template>
  <div class="s-profile">
    <!-- <el-col :span="12" class="aside">
      <el-menu default-active="1" class="el-menu-vertical-demo">
        <el-menu-item
          :index="item.index.toString()"
          v-for="(item,index) in menu"
          :key="index"
          @click="select(item.index.toString())"
        >
          <span slot="title">{{item.title}}</span>
        </el-menu-item>
      </el-menu>
    </el-col> -->
    <div class="aside">
      <div @click="show(1)" :class="[isShow==1?'selected':'']">学校简介</div>
      <div @click="show(2)" :class="[isShow==2?'selected':'']">历史沿改</div>
      <div @click="show(3)" :class="[isShow==3?'selected':'']">治理架构</div>
    </div>
    <div class="content" v-if="isShow==1">
      <h3>攀枝花学院简介</h3>
      <p>攀枝花学院是教育部布点在川西南、滇西北唯一一所以工为主的综合性普通本科院校。学校坐落于著名的钒钛之都、阳光花城、康养胜地、四川南向开放门户、全国唯一以花命名的优秀旅游城市--攀枝花市。</p>
      <p>学校始建于1983年，1994年与攀枝花教育学院合并，1998年四川省攀枝花卫生学校并入，2001年经教育部批准改建为本科院校并更名为攀枝花学院，2004年攀枝花市高级技工学校整体划归学校，2005年增列为学士学位授予单位，2007年攀枝花市中西医结合医院作为直管附属医院划归学校管理，2007年顺利通过教育部本科教学工作水平评估。现占地面积81.52万平方米，校舍面积54.06万平方米，固定资产总值7.58亿元，馆藏图书388.54万册（纸质图书139.08万册），教学科研仪器设备总值2.44亿元。下设20个教学单位、3个科研单位、7个教辅单位、16个党政群团部门、2个下属法人单位和1个直管三甲附属医院（攀枝花市中西医结合医院）。</p>
      <p>学校是全国100所应用型本科产教融合发展工程项目建设高校，开设有58个本科专业、41个专科专业，专业设置涵盖理、工、文、法、经、管、医、艺、农9个学科门类，形成了以工为主、多学科兼容，普通高等教育、高等职业教育、中职教育、成人高等教育协调发展的办学格局。2016年成立全国首个康养学院，2017年成立全国首个中国特色社会主义理论教育学院，2018年成立钒钛学院、智能制造学院和攀枝花纪检监察学院。建有国家级特色专业1个、国家级专业综合改革试点项目1个、省部级优势专业15个、省级特色专业6个、省级应用型示范专业3个、省级专业综合改革试点项目3个、省级卓越人才培养计划12项、省级精品课程11门。入选“教育部·中兴通讯ICT产教融合创新基地项目”第二批合作高校，2017年首届“中兴班”开班。</p>
      <p>师资力量雄厚，人才济济。现有教职工1138人，其中专任教师882人，副高及以上专业技术职务人员416人，占专任教师的47.16％；硕士以上学位638人，占专任教师的72.33％。现有国务院政府特殊专家津贴获得者1人，四川省学术和技术带头人1人，四川省第十一批学术和技术带头人后备人选17人，攀枝花市学术和技术带头人及其后备人选、攀枝花市有突出贡献专家、攀枝花市委直接掌握联系的高层次人才等67人。</p>
      <p>育人体系完备，成效显著。现有全日制本专科在校生及研究生、留学生近17000人，中专、技校在校生1186名。近年来，本科生毕业率和学位授予率均保持在90%以上，用人单位满意度保持在96%以上，连续多年被评为“四川省高校毕业生就业工作先进单位”，建校以来已为社会培养本专科毕业生5.6万余人。考研通过率呈逐年上升趋势，2018届学生毕业率96.1%、就业率96%。成立了创业学院、大学生创新创业俱乐部、大学生科技创业孵化园、大学科技园，大学生科技创业孵化园获批“四川省首批高校毕业生创业示范园区（基地）”，大学生创新创业俱乐部入选“四川省大学生创新创业俱乐部”，大学科技园通过省级大学科技园评审；近年来，立项大学生创新实验项目740余项，直接受益学生3000余人，孵化学生创业项目136个，成功孵化企业37家，实现创业就业近600人，带动参与创业大学生近11000人次。学生在各项学科竞赛、创新创业大赛中屡创佳绩，获得省部级及以上学科竞赛奖励1036项，其中国际级获奖3项，国家级获奖491项，2014年在美国大学生数学建模竞赛中获一等奖，2015年获全国大学生移动互联网创业大赛高校第一名。</p>
      <p>重视科研工作工作，成果丰硕。学校是四川省知识产权优势培育单位、四川省首批激励科技人员创新创业改革试点高校、四川省职务科技成果权属混合所有制改革试点单位。建有市级以上科研平台43个，其中国家钒钛检测重点实验室1个、国家级攀枝花钒钛孵化器1个，钒钛资源综合利用四川省重点实验室等省级重点实验室（工程研究中心）25个，攀枝花市岩矿重点实验室等市级科研平台16个。近年来，承担国家级科研项目5项，省部级科研项目280项，各级各类科研项目共计1249项，科研经费总额14933万元。获得省市级科技成果奖励150项，国内外公开发表学术论文9028篇，其中核心期刊1532篇，被SCI、SSCI、EI、CPCI检索收录1025篇，出版学术专著、教材360余部。获专利授权2244件，专利授权数在全国高校排名第156位、全省第6位。其中外观专利1250件,居四川全省第一，全国高校第七；发明专利501件，居全省第11位；实用新型493件,居全省第7位。在钒钛新材料、生物资源开发、太阳能技术等领域实现科技成果转化26项，可实现产值5亿元。</p>
      <p>坚持开放办学，合作广泛。先后与美国、英国、加拿大、瑞典、泰国、马来西亚等国外高校及四川大学、电子科技大学、西南大学、四川轻化工大学等国内高校，在教学、科研和研究生教育等方面建立了合作关系。与东南亚、南亚国家合作开展教师和留学生的培养、文化互通和科研交流，8名老挝留学生已完成学业并顺利毕业，目前共有76名留学生。</p>
      <p>扎根攀西沃土，成效明显。围绕攀枝花市“钒钛”“阳光”两篇文章，建设有国家钒钛检测重点实验室、国家级攀枝花钒钛科技孵化器等科研平台，组建了钒钛新能源材料及其应用省级创新团队，与攀钢集团、泓兵公司等相关企业围绕钒钛资源综合利用共建联合实验室15个，加入全国钒钛资源综合利用产业技术创新战略联盟、全国钛白粉产业技术创新战略联盟、四川省钒钛产业协会、四川省石墨烯产业技术创新联盟等产业联盟与学会，成为国家钒钛资源综合利用及钒钛新材料研发领域重要的科研基地和人才培养基地。牵头成立了攀枝花市太阳能产业技术创新联盟，承担了国家金太阳示范工程—2.1兆瓦太阳能屋顶光伏发电项目，大力开展太阳能热利用技术、光伏技术、钒钛功能材料技术等研究。成功开发了蔗渣种植灵芝、猴头、块菌等高效利用技术和以玛咖、块菌、蛹虫草为主要原料的“攀西三宝”系列保健产品。创建了以“攀枝花县域发展论坛”为平台的校地合作模式，近年来承担政府委托课题和咨询项目40余项。成人高等学历教育累计输送毕业生15871人。扎实开展精准扶贫工作，做好木里县及纳子店村、乡城县及热郎宫村和米易县仙山村对口帮扶工作，2016年、2017年连续被省委、省政府评为“五个一”精准扶贫先进单位。</p>
      <p>近年来，学校被授予“全国文明单位”“全国五四红旗团委”、“全国大学生暑期社会实践先进集体”“全国绿化模范先进单位”“四川省最佳文明单位”“四川省优秀文明校园”“四川省高新技术产业示范科研单位”“四川省人才开发先进单位”“四川省高校毕业生就业工作先进单位”“四川省思想政治工作先进单位”“四川省兴川战略人才强省示范基地”等荣誉称号。</p>
      <p>在新的历史起点上，学校将全面落实党的教育方针和立德树人的根本任务，主动适应经济发展新常态，融入产业转型升级和创新驱动发展，以提高应用型人才培养质量为核心，以转型发展为主线，以产教融合为着力点，推动学科专业、人才培养、科学研究、社会服务、文化传承与创新、国际交流与合作协调发展，全面建设产教融合、转型发展示范院校和应用型一流大学，使学校成为川西南、滇西北高素质应用型专门人才培养的重要基地，区域技术创新和科技成果转化的重要平台，支撑攀西经济社会发展的“智库”，引领地方文化传承创新及文化产业发展的重要力量。</p>
    </div>
    <div class="content" v-if="isShow==2">
      <h3>攀枝花学院历史沿革</h3>
      <p>攀枝花学院起步于攀枝花大学。攀大的创建始于国家三线建设调整时期。由于攀枝花市（原渡口市）地处边远山区，生活条件较艰苦，多年来存在“人才进不来、来了留不住”的难题，人才短缺曾经成为城市经济建设中的突出矛盾。</p>
      <p>20 世纪 80 年代，攀枝花早期建设者子女进入上大学年龄段的人数急剧增加。由于是新兴工业城市，教育基础薄弱，能考上大学的人数十分有限，子女上学难、就业难成为攀枝花职工队伍一个不稳定因素。为缓解攀枝花市人才需求矛盾，满足职工子女上大学的要求，在时任中共中央政治局委员、国务委员、国务院副总理方毅的倡议和指导下，中共渡口市委、渡口市人民政府积极酝酿自己办一所大学。</p>
      <p>1983年11月，经四川省人民政府批准，攀枝花大学（地方性专科学校）成立，方毅亲自为之题写校名。</p>
      <p>1984年9月，首届中文秘书、中文师资、工业与民用建筑 3 个专业 118 名新生进校。</p>
      <p>1994年3月，攀枝花教育学院（1987年前称“渡口教育学院”）与攀枝花大学合并。</p>
      <p>1998年8月，攀枝花卫生学校并入攀枝花大学。</p>
      <p>2001年7月，攀枝花大学升建成为普通本科学院，更名攀枝花学院。学院以本科教育为主，同时举办专科层次高等职业教育，实行省市共建、以省为主的办学体制。9月12日，第一届730名本科学生报道入学。</p>
      <p>2002 年1月18日 ，攀枝花学院举行挂牌庆典活动，攀枝花学院正式成立。</p>
      <p>2004年3月，攀枝花市高级技术工人学校成建制划归攀枝花学院，成为攀枝花学院一个新的直属教学单位。</p>
      <p>2005年6月，省政府学位办同意将攀枝花学院增列为学士学位授予单位，学校获学士学位授予权。</p>
      <p>2007年8月，攀枝花市中西医结合医院、铁路医院划归攀枝花学院管理，为学校医学教育的发展夯实了基础。</p>
      <p>2007年11月，教育部专家组莅临攀枝花学院，对学校进行本科教学工作水平评估，评估结果为良好。</p>
    </div>
    <div class="content" v-if="isShow==3">
      <h3>攀枝花学院治理架构</h3>
      <h4>党委领导</h4>
    </div>
    <div class="content" v-if="isShow==4">3</div>
    <div class="content" v-if="isShow==5">3</div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      menu: [
        { index: 1, title: "学校简介" },
        { index: 2, title: "历史沿改" },
        { index: 3, title: "治理架构" },
        { index: 4, title: "非常设机构" },
        { index: 5, title: "章程制度" }
      ],
      isShow: 1
    };
  },
  methods: {
    show(index) {
      this.isShow = index;
    }
  }
};
</script>
<style lang="scss" scoped>
.none {
  display: none;
}
.block {
  display: block;
}
.s-profile {
  margin: 50px 150px;
  display: flex;
  justify-content: space-between;
  position: relative;
  .aside {
    margin-right: 30px;

    div {
      padding: 5px;
      padding-left: 1rem;
      height: 30px;
      line-height: 30px;
      margin-top: 4px;
      background-color: #fff;
      min-width: 150px;
      cursor: pointer;
      color: #505459;
    }
     .selected {
      background-color: #ff6b45;
      color: #fff;
    }
  }
}
.el-col-12 {
  width: 200px;
  // background-color: #ccc;
 
}

.title {
  margin: 0;
}
.el-menu {
  background-color: #ccc;
}
.content {
 margin: 0 auto;
    padding: 0 50px;
    // box-shadow: 2px 2px 5px 0 #666;
    // background-color: #fff;
    width: 100%;
  h3 {
    text-align: center;
  }
  p {
    text-indent: 2rem;
    text-align: left;
    line-height: 24px;
  }
}
</style>